import { Box } from '@mui/material';
import React from 'react';
import './about.css';

//import { serverSideTranslations } from 'next-i18next/serverSideTranslations';

const About: React.FC = () => {
  return (
    <>
      <Box
        width="100%"
        display="flex"
        justifyContent="center"
        alignItems="top"
        flexDirection="row"
        flex={1}
        position="relative"
        p={0}
      >
        <div className="about-container">
          <h2 className="our-product-heading">Базы данных зеленых насаждений г. Тараз</h2>
          {/* <h2 className="our-product-heading">Тараз қаласының жасыл желектерінің дерекқоры</h2> */}
          <div className="profile-image">
            <img style={{ width: '60%' }} src="images/Taraz.jpg" alt="Taraz" className="center" />
          </div>

          <div className="description">
            <p>
              26 сентября 2024 года на основании Договора № 565 «Институтом ботаники и фитоинтродукции» КЛХЖМ МЭПР РК
              был создана база данных зеленых насаждений города Тараз, по заказу Коммунального государственного
              учреждения "Отдел жилищно-коммунального хозяйства, пассажирского транспорта и автомобильных дорог акимата
              города Тараз Жамбылской области". База данных основана на оценке современного состояния зеленых
              насаждений. Создана дорожная карта содержания и развития зеленых насаждений города Тараз для постоянного
              учета количественных и качественных параметров их состояния на участках города. В Базе данных отображена
              информация с разбивкой по жизненным формам зеленых насаждений и ландшафтно-архитектурным функциям (дерево,
              кустарник, живая изгородь и другие), а также по агротехническим мероприятиям (полив, обрезка, санитарная
              обрезка, кронирование и другое).
            </p>
            {/* <p>
            2024 жылғы 26 қыркүйектегі № 565 шартының негізінде ҚР ЭТРМ ОШЖДК "Ботаника және фитоинтродукция институты" ШЖҚ РМК ғылыми институты "Жамбыл облысы Тараз қаласы әкімдігінің тұрғын жай-коммуналдық шаруашылық, жолаушы көлігі және автомобиль жолдары бөлімі" коммуналдық мемлекеттік мекемесінің тапсырысы бойынша Тараз қаласының жасыл желектер базасың жасап шығарды. Деректер базасы жасыл желектердің қазіргі жағдайын бағалауға негізделген. Қала учаскелерінде олардың жай-күйінің сандық және сапалық параметрлерін тұрақты есепке алу үшін, Тараз қаласының жасыл желектерін күтіп ұстау мен дамытудың жол картасы жасалды. Деректер базасында жасыл желектердің тіршілік формалары мен ландшафттық-сәулеттік функциялары (ағаш, бұта, хеджирлеу және басқалары), сондай-ақ агротехникалық іс-шаралар (суару, кесу, санитарлық кесу, тәждеу және т.б.) бойынша мәліметтер көрсетілген.
          </p> */}
          </div>
        </div>
      </Box>
    </>
  );
};

export default About;